ChannelConjugateHeat/aero/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
    "(cold_air_in|cold_air_out|hot_air_in|hot_air_out)"
    {
        type            calculated;
        value           $internalField;
    }
    "(.*_outer|.*_inner|.*_sides)"
    {
        type            fixedValue;
        value           uniform 1e-16;
    }
}


// ************************************************************************* //
