ChannelConjugateHeat/aero/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    hot_air_in
    {
        type            outletInlet;
        outletValue     uniform 101325;
        value           uniform 101325;
    }
    hot_air_out
    {
        type            fixedValue;
        value           $internalField;
    }
    cold_air_in
    {
        type            outletInlet;
        outletValue     uniform 101325;
        value           uniform 101325;
    }
    cold_air_out
    {
        type            fixedValue;
        value           $internalField;
    }

    "(.*_outer|.*_inner|.*_sides)"
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
