ChannelConjugateHeat/aero/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    cold_air_out
    {
        type            patch;
        nFaces          100;
        startFace       22200;
    }
    cold_air_in
    {
        type            patch;
        nFaces          100;
        startFace       22300;
    }
    cold_air_outer
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       22400;
    }
    cold_air_inner
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       22800;
    }
    cold_air_sides
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       23200;
    }
    hot_air_in
    {
        type            patch;
        nFaces          100;
        startFace       24000;
    }
    hot_air_out
    {
        type            patch;
        nFaces          100;
        startFace       24100;
    }
    hot_air_outer
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       24200;
    }
    hot_air_inner
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       24600;
    }
    hot_air_sides
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       25000;
    }
)

// ************************************************************************* //
