ChannelConjugateHeat/aero/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType 
{ 
    type            hePsiThermo; 
    mixture         pureMixture; 
    transport       const; 
    thermo          hConst; 
    equationOfState perfectGas; 
    specie          specie; 
    energy          sensibleEnthalpy; 
} 

mixture 
{ 
    specie 
    { 
        molWeight   28.970000; 
    } 
    thermodynamics 
    { 
        Cp          1005.000000; 
        Hf          0.000000; 
        gamma 1.4;
    } 
    transport 
    { 
        mu              0.000018; 
        Pr              0.700000; 
        TRef            300.000000; 
        
    } 
} 

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
