ChannelConjugateHeat/aero/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0. 0. 0.)
    (1. 0. 0.)
    (1. 0.05 0.)
    (0. 0.05 0.)
    (0. 0.  0.05)
    (1. 0. 0.05)
    (1. 0.05 0.05)
    (0. 0.05 0.05)

    (0. 0.06 0.)
    (1. 0.06 0.)
    (1. 0.11 0.)
    (0. 0.11 0.)
    (0. 0.06  0.05)
    (1. 0.06 0.05)
    (1. 0.11 0.05)
    (0. 0.11 0.05)
);

blocks
(
  hex (0 1 2 3 4 5 6 7) (40 10 10) 
  simpleGrading 
  (
      1.0
      (
          (0.5 0.5 2)
          (0.5 0.5 0.5)
      )
      (
          (0.5 0.5 2)
          (0.5 0.5 0.5)
      )
  )

  hex (8 9 10 11 12 13 14 15) (40 10 10) 
  simpleGrading 
  (
      1.0
      (
          (0.5 0.5 2)
          (0.5 0.5 0.5)
      )
      (
          (0.5 0.5 2)
          (0.5 0.5 0.5)
      )
  )
);

edges
(
);

boundary
(
    cold_air_out
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    cold_air_in
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    cold_air_outer
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    cold_air_inner
    {
        type wall;
        faces
	    (
            (0 4 5 1)
        );
    }
    cold_air_sides
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }

    hot_air_in
    {
        type patch;
        faces
        (
            (8 12 15 11)
        );
    }
    hot_air_out
    {
        type patch;
        faces
        (
            (9 13 14 10)
        );
    }
    hot_air_outer
    {
        type wall;
        faces
        (
            (11 15 14 10)
        );
    }
    hot_air_inner
    {
        type wall;
        faces
	    (
            (8 12 13 9)
        );
    }
    hot_air_sides
    {
        type wall;
        faces
        (
            (8 9 10 11)
            (12 13 14 15)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
